app/controllers/students_controller.rb

INSERT INTO "students" ("name", "grade", "department", "education_number", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    teacher = current_teacher
    @student = teacher.students.build(student_params)
    if @student.save